renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_cdataio.c
    return err;
} /* End of function usb_data_read() */

/******************************************************************************
 Function Name   : usb_data_write
 Description     : USB data write processing
 Arguments       : usb_ctrl_t *p_ctrl: Control structure for USB API.
                 : uint8_t *buf      : Transfer data address
                 : uint32_t size     : Transfer length
 Return value    : usb_er_t          : USB_OK / USB_ERROR.
 ******************************************************************************/
usb_er_t usb_data_write (usb_ctrl_t *p_ctrl, uint8_t *buf, uint32_t size)
{
    uint8_t pipe;
    usb_er_t err;
    usb_utr_t   *p_tran_data;
#if (BSP_CFG_RTOS_USED == 1)
    usb_utr_t   tran_data;
#endif /* BSP_CFG_RTOS_USED == 1 */

    pipe = usb_get_usepipe(p_ctrl, USB_WRITE);

    if ((p_ctrl->type) > USB_PVND)
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)

#if (BSP_CFG_RTOS_USED == 1)
        p_tran_data = (usb_utr_t *)&tran_data;
#else  /* BSP_CFG_RTOS_USED == 1 */
        p_tran_data = (usb_utr_t *)&g_usb_hdata[p_ctrl->module][pipe];
#endif /* BSP_CFG_RTOS_USED == 1 */

        p_tran_data->keyword = pipe; /* Pipe No */
        p_tran_data->p_tranadr = buf; /* Data address */
        p_tran_data->tranlen = size; /* Data Size */
        p_tran_data->complete = g_usb_callback[(p_ctrl->type * 2) + 1]; /* Callback function */
        p_tran_data->segment = USB_TRAN_END;
        p_tran_data->ip = p_ctrl->module;
        p_tran_data->ipp = usb_hstd_get_usb_ip_adr((uint8_t) p_ctrl->module);
        err = usb_hstd_transfer_start(p_tran_data);
#endif
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)

#if (BSP_CFG_RTOS_USED == 1)
        p_tran_data = (usb_utr_t *)&tran_data;
#else  /* BSP_CFG_RTOS_USED == 1 */
        p_tran_data = (usb_utr_t *)&g_usb_pdata[pipe];
#endif /* BSP_CFG_RTOS_USED == 1 */

  #if defined(USB_CFG_PCDC_USE)
        if (USB_CFG_PCDC_INT_IN != pipe)
        {
            p_tran_data->p_tranadr = buf; /* Data address */
            p_tran_data->tranlen = size; /* Data Size */
        }
        else
        {
            g_usb_pcdc_serialstate_table[8] = buf[0];
            g_usb_pcdc_serialstate_table[9] = buf[1];
            p_tran_data->p_tranadr = g_usb_pcdc_serialstate_table; /* Data address */
            p_tran_data->tranlen = 10; /* Data Size */
        }

  #else   /* defined(USB_CFG_PCDC_USE) */
        p_tran_data->p_tranadr = buf; /* Data address */
        p_tran_data->tranlen = size; /* Data Size */
  #endif  /* defined(USB_CFG_PCDC_USE) */
        p_tran_data->keyword = pipe; /* Pipe No */
        p_tran_data->complete = (usb_cb_t)g_usb_callback[(p_ctrl->type*2)+1]; /* Callback function */
        err = usb_pstd_transfer_start(p_tran_data);
#endif /* ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI) */
    }

    return err;
} /* End of function usb_data_write() */

/******************************************************************************
 Function Name   : usb_data_stop
 Description     : USB data transfer stop processing
 Arguments       : usb_ctrl_t *p_ctrl: control structure for USB API.
                 : uint16_t type     : Read(0)/Write(1)
 Return value    : usb_er_t          : USB_OK / USB_ERROR.
 ******************************************************************************/
usb_er_t usb_data_stop (usb_ctrl_t *p_ctrl, uint16_t type)
{
    uint8_t pipe;
    usb_er_t err = USB_ERROR;
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
    usb_utr_t utr;
#endif

    pipe = usb_get_usepipe(p_ctrl, type);

    if (USB_NULL == pipe)
    {
        return USB_ERROR;
    }

    if ((p_ctrl->type) > USB_PVND)
    {
        /* Host only */
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        utr.ip = p_ctrl->module;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);
        err = usb_hstd_transfer_end(&utr, pipe, (uint16_t) USB_DATA_STOP);
#endif
    }
    else
    {
        /* Peripheral only */
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        err = usb_pstd_transfer_end(pipe);
#endif
    }
    return err;
} /* End of function usb_data_stop() */

/******************************************************************************
 Function Name   : usb_get_usepipe
 Description     : Get pipe number for USB Read/USB Write
 Arguments       : usb_ctrl_t *p_ctrl: Control structure for USB API.
                 : uint8_t dir       : Read(0)/Write(1)
 Return value    : Bitmap of Use pipe
 ******************************************************************************/
uint8_t usb_get_usepipe (usb_ctrl_t *p_ctrl, uint8_t dir)
{
    uint8_t pipe = USB_NULL;
    uint8_t idx;

    if ((p_ctrl->type) > USB_PVND)
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        /* Host */
        idx = (((p_ctrl->type - USB_HCDC) * 8) + ((p_ctrl->address - 1) * 2)) + dir;
        pipe = g_usb_pipe_host[idx];
#endif
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        /* Peripheral */
        idx = (p_ctrl->type * 2) + dir;
        pipe = g_usb_pipe_peri[idx];
#endif
    }
    return pipe;
} /* End of function usb_get_usepipe() */

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)

/******************************************************************************
 Function Name   : usb_cstd_get_pipe_buf_value
 Description     : Get Value for USBA Module PIPE BUF REG.
 Arguments       : Pipe no.
 Return value    : PIPE BUF set value.
 ******************************************************************************/
uint16_t usb_cstd_get_pipe_buf_value (uint16_t pipe_no)
{
    uint16_t pipe_buf;

    switch (pipe_no)
    {
#if defined(USB_CFG_HCDC_USE)
        case USB_CFG_HCDC_BULK_IN:
  #if (USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_HCDC_MULTI == USB_CFG_ENABLE)
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(8u));
  #else     /* (USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_HCDC_MULTI == USB_CFG_ENABLE) */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(8u));
  #endif    /* (USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_HCDC_MULTI == USB_CFG_ENABLE) */
        break;

        case USB_CFG_HCDC_BULK_OUT:
  #if (USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_HCDC_MULTI == USB_CFG_ENABLE)
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(36u));
  #else     /* (USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_HCDC_MULTI == USB_CFG_ENABLE) */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(72u));
  #endif    /* (USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_HCDC_MULTI == USB_CFG_ENABLE) */
        break;

        case USB_CFG_HCDC_BULK_IN2:
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(72u));
        break;

        case USB_CFG_HCDC_BULK_OUT2:
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(104u));
        break;
#endif /* defined(USB_CFG_HCDC_USE) */

#if defined(USB_CFG_HMSC_USE)
        case USB_PIPE1:
        case USB_PIPE2:
        case USB_PIPE3:
        case USB_PIPE4:
        case USB_PIPE5:
  #if USB_CFG_DTC == USB_CFG_ENABLE
            pipe_buf = (USB_BUF_SIZE(1024u) | USB_BUF_NUMB(8u));
  #else     /* USB_CFG_DTC == USB_CFG_ENABLE */
            pipe_buf = (USB_BUF_SIZE(2048u) | USB_BUF_NUMB(8u));
  #endif    /* USB_CFG_DTC == USB_CFG_ENABLE */
        break;
#endif /* defined(USB_CFG_HMSC_USE) */

